html/kotlin/basic/jump.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>返回和跳转</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Wu, Shanliang" />
<link rel="stylesheet" type="text/css" href="../css/main.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./control_flow.html"> UP </a>
 |
 <a accesskey="H" href="./basic.html"> HOME </a>
</div><div id="content">
<h1 class="title">返回和跳转</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org602ab2d">Break 与 Continue 标签</a></li>
<li><a href="#org9939ffb">return 到标签</a></li>
</ul>
</div>
</div>
<p>
Kotlin 有三种结构化跳转 <b>表达式</b> ：
</p>
<ul class="org-ul">
<li><span class="underline">return</span> : 默认从最直接包围它的函数或者匿名函数返回</li>
<li><span class="underline">break</span> : 终止最直接包围它的循环</li>
<li><span class="underline">continue</span> : 继续下一次最直接包围它的循环</li>
</ul>

<p>
所有这些表达式都可以用作更大表达式的一部分：
</p>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">val</span> <span style="color: #4eee94;">s</span> = person.name ?: <span style="color: #00bfff; font-weight: bold;">return</span>
</pre>
</div>

<pre class="example">
  这些表达式的类型是 Nothing 类型
</pre>
<div id="outline-container-org602ab2d" class="outline-2">
<h2 id="org602ab2d">Break 与 Continue 标签</h2>
<div class="outline-text-2" id="text-org602ab2d">
<p>
在 Kotlin 中任何表达式都可以用标签 <span class="underline">label</span> 来标记。 标签的格式为 <span class="underline">标识符</span> 后跟 <span class="underline">@</span> 符号
</p>

<pre class="example">
    例如：abc@、fooBar@ 都是有效的标签
</pre>

<p>
要为一个表达式加标签，只要在其前加标签即可：
</p>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #ffd700;">loop</span>@ <span style="color: #00bfff; font-weight: bold;">for</span> (i <span style="color: #00bfff; font-weight: bold;">in</span> 1..100) {
    <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">&#8230;&#8230;</span>
}
</pre>
</div>

<p>
可以用标签限制 break 或者continue：
</p>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #ffd700;">loop</span>@ <span style="color: #00bfff; font-weight: bold;">for</span> (i <span style="color: #00bfff; font-weight: bold;">in</span> 1..100) {
    <span style="color: #00bfff; font-weight: bold;">for</span> (j <span style="color: #00bfff; font-weight: bold;">in</span> 1..100) {
        <span style="color: #00bfff; font-weight: bold;">if</span> (&#8230;&#8230;) <span style="color: #00bfff; font-weight: bold;">break</span>@loop
    }
}
</pre>
</div>

<ul class="org-ul">
<li>break 标签跳转到刚好位于该标签指定的循环后面的执行点</li>
<li>continue 继续标签指定的循环的下一次迭代</li>
</ul>
</div>
</div>
<div id="outline-container-org9939ffb" class="outline-2">
<h2 id="org9939ffb">return 到标签</h2>
<div class="outline-text-2" id="text-org9939ffb">
<pre class="example">
Kotlin 有函数字面量、局部函数和对象表达式。因此 Kotlin 的函数可以被嵌套
</pre>

<p>
标签限制的 return 允许从外层函数返回。 最重要的一个用途就是 从 <span class="underline">lambda 表达式</span> 中 <b>返回</b> 。假如这么写的时候：
</p>

<div class="org-src-container">
<pre class="src src-kotlin">
<span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">sampleStart</span>
<span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">foo</span>() {
    listOf(1, 2, 3, 4, 5).forEach <span style="color: #ffd700;">lit</span>@{
        <span style="color: #00bfff; font-weight: bold;">if</span> (<span style="color: #00bfff; font-weight: bold;">it</span> == 3) <span style="color: #00bfff; font-weight: bold;">return</span>@lit <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">&#23616;&#37096;&#36820;&#22238;&#21040;&#35813; lambda &#34920;&#36798;&#24335;&#30340;&#35843;&#29992;&#32773;&#65292;&#21363; forEach &#24490;&#29615;</span>
        print(<span style="color: #00bfff; font-weight: bold;">it</span>)
    }
    print(<span style="color: #deb887;">" done with explicit label"</span>)
}
<span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">sampleEnd</span>

<span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">main</span>() {
    foo()
}
</pre>
</div>

<pre class="example">
    现在，它只会从 lambda 表达式中返回
</pre>

<p>
通常情况下使用隐式标签更方便。 该标签与接受该 lambda 的函数同名：
</p>

<div class="org-src-container">
<pre class="src src-kotlin">
<span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">sampleStart</span>
<span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">foo</span>() {
    listOf(1, 2, 3, 4, 5).forEach {
        <span style="color: #00bfff; font-weight: bold;">if</span> (<span style="color: #00bfff; font-weight: bold;">it</span> == 3) <span style="color: #00bfff; font-weight: bold;">return</span>@forEach <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">&#23616;&#37096;&#36820;&#22238;&#21040;&#35813; lambda &#34920;&#36798;&#24335;&#30340;&#35843;&#29992;&#32773;&#65292;&#21363; forEach &#24490;&#29615;</span>
        print(<span style="color: #00bfff; font-weight: bold;">it</span>)
    }
    print(<span style="color: #deb887;">" done with implicit label"</span>)
}
<span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">sampleEnd</span>

<span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">main</span>() {
    foo()
}
</pre>
</div>

<p>
或者，用一个 <b>匿名函数</b> 替代 <span class="underline">lambda 表达式</span> 。 匿名函数内部的 return 语句将从该匿名函数自身返回：
</p>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">sampleStart</span>
<span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">foo</span>() {
    listOf(1, 2, 3, 4, 5).forEach(<span style="color: #00bfff; font-weight: bold;">fun</span>(value: <span style="color: #98f5ff;">Int</span>) {
        <span style="color: #00bfff; font-weight: bold;">if</span> (value == 3) <span style="color: #00bfff; font-weight: bold;">return</span>  <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">&#23616;&#37096;&#36820;&#22238;&#21040;&#21311;&#21517;&#20989;&#25968;&#30340;&#35843;&#29992;&#32773;&#65292;&#21363; forEach &#24490;&#29615;</span>
        print(value)
    })
    print(<span style="color: #deb887;">" done with anonymous function"</span>)
}
<span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">sampleEnd</span>

<span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">main</span>() {
    foo()
}
</pre>
</div>

<pre class="example">
    请注意，这三个示例中使用的局部返回类似于在常规循环中使用 continue
</pre>


<p>
并没有 break 的直接等价形式，不过可以通过增加另一层嵌套 lambda 表达式并从其中非局部返回来模拟：
</p>

<div class="org-src-container">
<pre class="src src-kotlin">
<span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">sampleStart</span>
<span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">foo</span>() {
    run <span style="color: #ffd700;">loop</span>@{
        listOf(1, 2, 3, 4, 5).forEach {
            <span style="color: #00bfff; font-weight: bold;">if</span> (<span style="color: #00bfff; font-weight: bold;">it</span> == 3) <span style="color: #00bfff; font-weight: bold;">return</span>@loop <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">&#20174;&#20256;&#20837; run &#30340; lambda &#34920;&#36798;&#24335;&#38750;&#23616;&#37096;&#36820;&#22238;</span>
            print(<span style="color: #00bfff; font-weight: bold;">it</span>)
        }
    }
    print(<span style="color: #deb887;">" done with nested loop"</span>)
}
<span style="color: #5f9ea0; font-style: italic;">//</span><span style="color: #5f9ea0; font-style: italic;">sampleEnd</span>

<span style="color: #00bfff; font-weight: bold;">fun</span> <span style="color: #daa520; font-weight: bold;">main</span>() {
    foo()
}
</pre>
</div>

<p>
注意，当要返一个回值的时候，解析器优先选用 <b>标签限制</b> 的 return，例如：
</p>

<div class="org-src-container">
<pre class="src src-kotlin"><span style="color: #00bfff; font-weight: bold;">return</span>@a 1
</pre>
</div>

<p>
意为“返回 1 到 @a”
</p>

<pre class="example">
    而不是“返回一个标签标注的表达式 (@a 1)”
</pre>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="control_flow.html">Previous：控制流</a></td>
<td class="org-left"><a href="basic.html">Home：基础</a></td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="postamble" class="status">

		  <br/>
		  <div class='ds-thread'></div>
		  <script>
		  var duoshuoQuery = {short_name:'klose911'};
		  (function() {
					  var dsThread = document.getElementsByClassName('ds-thread')[0];
					  dsThread.setAttribute('data-thread-key', document.title);
					  dsThread.setAttribute('data-title', document.title);
					  dsThread.setAttribute('data-url', window.location.href);
					  var ds = document.createElement('script');
					  ds.type = 'text/javascript';ds.async = true;
					  ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
					  ds.charset = 'UTF-8';
					  (document.getElementsByTagName('head')[0] 
						|| document.getElementsByTagName('body')[0]).appendChild(ds);
					  })();
		  </script>
		  <script>
		  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
			(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
			m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
			})(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
		  ga('create', 'UA-90850421-1', 'auto');
		  ga('send', 'pageview');
		  </script>
</div>
</body>
</html>
